Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.StructuralSectionsService
The external service supporting view and modification of the structural sections shape in structural elements.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.MemberForcesService
The external service supporting view and modification of the member forces in analytical elements.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DirectContext3DService
The external service supporting drawing not Revit models using third party API.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CodeCheckingParameterService
The external service supporting view and modification of the structural code checking parameter in analytical elements.